{
    "version": "https://jsonfeed.org/version/1",
    "title": "TheCrafters001 • All posts by \"node\" tag",
    "description": "Making free software and games! All Open-Source!",
    "home_page_url": "https://thecrafters001.ga",
    "items": [
        {
            "id": "https://thecrafters001.ga/08/29/2020/Hexo-a-Node-JS-Powered-CMS/",
            "url": "https://thecrafters001.ga/08/29/2020/Hexo-a-Node-JS-Powered-CMS/",
            "title": "Hexo, a Node.JS Powered CMS.",
            "date_published": "2020-08-30T00:13:00.000Z",
            "content_html": "<p>Alright, first off, I am going to say this: I don’t own Hexo. But I do like the utility, and I recently just build a new website for it. This post will allow me to reflect on what I think about it. <a id=\"more\"></a></p>\n<p>First off. The ease of use. I know that sounds weird, but it is true. It is super easy to install with the simple 5 line initialization script. This is what the script is:</p>\n<figure class=\"highlight plain\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br><span class=\"line\">4</span><br><span class=\"line\">5</span><br></pre></td><td class=\"code\"><pre><span class=\"line\">npm install hexo-cli -g</span><br><span class=\"line\">hexo init blog</span><br><span class=\"line\">cd blog</span><br><span class=\"line\">npm install</span><br><span class=\"line\">hexo server</span><br></pre></td></tr></table></figure>\n\n<p>That is it. That is the whole script. Thing is, if you want to create a new blog, you don’t need to use the <code>npm install hexo-cli -g</code> every time. It is a one time command that installs it to the whole system. So if you wanted to make a new blog (without installing Hexo), all you need to type is: </p>\n<figure class=\"highlight plain\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br><span class=\"line\">4</span><br></pre></td><td class=\"code\"><pre><span class=\"line\">hexo init blog</span><br><span class=\"line\">cd blog</span><br><span class=\"line\">npm install</span><br><span class=\"line\">hexo server</span><br></pre></td></tr></table></figure>\n\n<p>Now, I know that the command line is intimidating to some people, but this makes it super simple.</p>\n<p>The next part is the amount of plugins. While 359 plugins (at the time of writing this) does not sound like a lot, they are all powerfull. I made this article using a plugin called <a href=\"https://github.com/jaredly/hexo-admin\"><code>hexo-admin</code></a>. The back end is really easy to navigate, and it won’t get pushed with the rest of the site, when you push it to any static website hosting services. Speaking of which, Hexo supports deploying to Static Hostings, as it generates Static files (no dynamic files are generated, for details on that, visit <a href=\"http://hexo.io/\">hexo.io</a>), and allows you to deploy it using one simple command.</p>\n<figure class=\"highlight plain\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br></pre></td><td class=\"code\"><pre><span class=\"line\">hexo deploy</span><br></pre></td></tr></table></figure>\n\n<p>This is how you deploy it to a hosting. I have it setup in the config file (&UnderBar;config.yml) to push to a GitHub repo, <a href=\"https://github.com/TheCrafters001/TheCrafters001\">which is how I am hosting my website</a>. Hexo allows for other types of deployment, with the following Static Hostings:</p>\n<ul>\n<li>Git</li>\n<li>Heroku</li>\n<li>Netlify</li>\n<li>Rsync</li>\n<li>OpenShift</li>\n<li>FTPSync</li>\n<li>SFTP</li>\n<li>Vercel</li>\n<li>21YunBox</li>\n<li>Bip</li>\n</ul>\n<p>I find it nice that you can push to may different hostings. It allows for flexability. Not only that, if you host a website in multiple places, you are able to push changes to all of the ones at once. All thanks to a few lines in the &UnderBar;config.yml file. I have mine setup to push to my repo, which is really fast. However, you will need to clean the <code>public</code> folder if you want to push any changes that you have made. The plus side, is they even built in a command for that.</p>\n<figure class=\"highlight plain\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br></pre></td><td class=\"code\"><pre><span class=\"line\">hexo clean</span><br><span class=\"line\">hexo deploy</span><br></pre></td></tr></table></figure>\n\n<p>This is an example of the clean and push method. Anyway, I am getting off track, so let me get back on track. Hexo supports custom theming! Sadly, most of the themes you will find are in a foreign language. For mine, I use a theme called <a href=\"https://theme-next.org/\">NexT</a>. It has a included Dark theme, so I thought I would use it, and I am really happy with the way it came out. By default, Hexo comes with a theme that the Hexo team made, called Landscape. But if you arn’t happy with any of the themes that come with Hexo, they allow you to make your own! <a href=\"https://hexo.io/docs/themes.html\">They even provide documentation on how to make one</a>! But, I don’t think I will make my own theme for Hexo. If I do, it would not look good anyway, as I am not good with Swig, the default rendering engine. But hey, that is me.</p>\n<p>Aside from that, I reall like Hexo. It is super simple to use, and understand. I am not going to get into specifics on how the file structure works, all I know is that I can add a new MD file in the &UnderBar;post folder, and start writing. Personally, I just like to use the admin backend that is <code>hexo-admin</code>. Who am I to stop you from doing you, though. Most of this may have just been a rant, but I honestly do like Hexo. Hexo is a cool little program that uses the <a href=\"https://nodejs.org/\">Node.JS backend</a>. While I am still trying to learn NodeJS, I just think it is a cool little program. Anyway, I am going to end this post here before I start rambling again. So, thank you for reading, and I hope you have a nice rest of your day.</p>\n\n<div id=\"gitalk-container\"></div>\n<script src=\"https://cdn.bootcss.com/blueimp-md5/2.12.0/js/md5.min.js\"></script><link rel=\"stylesheet\" href=\"https://unpkg.com/gitalk/dist/gitalk.css\"><script src=\"https://unpkg.com/gitalk/dist/gitalk.min.js\"></script>\n\n\t\t<script>\n\t\tvar gitalkConfig = {\"clientID\":\"1ee99b59f661ba2c70d4\",\"clientSecret\":\"44379937dd4de9437db1c4d986ec7289ce69765e\",\"repo\":\"TheCrafters001\",\"owner\":\"TheCrafters001\",\"admin\":[\"TheCrafters001\"],\"distractionFreeMode\":false};\n\t    gitalkConfig.id = md5(location.pathname);\n\t\tvar gitalk = new Gitalk(gitalkConfig);\n\t    gitalk.render(\"gitalk-container\");\n\t    </script>",
            "tags": [
                "Hexo",
                "CMS",
                "Website",
                "Node",
                "JS"
            ]
        }
    ]
}